# 03/05 금요일

# 사칙연산 - 사칙연산

# 사칙연산 - 곱셈

# if문 - 알람 시계

# while 문 - 더하기 사이클

# 03/06 토요일

# 1차원 배열 - 평균은 넘겠지

# 함수 - 셀프넘버

# 문자열 - 단어공부

# 문자열 - 크로아티아 알파벳

# 03/08 월요일

# 기본 수학 1 - 달팽이는 올라가고 싶다

# 기본 수학 1 - ACM 호텔

# 기본 수학 2 - 소수 구하기

# 03/08 월요일

# 알고리즘 강의 1주차

# 최대값 찾기

# 최빈값 찾기

# 알고리즘 강의 2주차

# 더하거나 빼거나

# 03/09 화요일

# 재귀 - 하노이 탑 이동 순서 - 건너뜀

# 정렬 - 좌표 정렬하기 2

# 이분탐색 - 나무 자르기

# 03/10 수요일

# 스택 - 균형잡힌 세상

# 스택 - 스택 수열

# 큐 - 회전하는 큐

# 03/11 목요일

# DFS와 BFS - 바이러스

# DFS와 BFS - 토마토 - 건너뜀

# 동적계획법 - 피보나치 함수

# 동적계획법 - 가장 긴 증가하는 부분 수열 - 건너뜀

# 03/12 금요일

# 시험

# 이분 탐색 - 숫자 카드

# 큐, 덱 - 카드2

# 정렬 - 수 정렬하기 2

# 문자열 - 그룹 단어 체커

# 기본 수학 1 - 설탕 배달

# 기본 수학 1 - Fly me to the Alpha Centauri - 건너 뜀

# 기본 수학 2 - 베르트랑 공준

# 03/13 토요일

# 브루트포스 - 영화감독 숌

# 큐, 덱 - 요세푸스 순열

# 동적 계획법 1 - 신나는 함수 실행

# 동적 계획법 1 - 파도반 수열

# 동적 계획법 1 - 정수 삼각형

# 정수론 및 조합론 - 약수

# DFS와 BFS - DFS와 BFS

# 백트래킹 - N과 M - Combination으로 품

# 03/15 월요일

# 정렬 - 통계학

# 분할정복 - 색종이 만들기

# 동적 계획법 1 - RGB 거리

# 그리디 알고리즘 - 동전 0

# 그리디 알고리즘 - ATM

# 분할정복 - 쿼드 트리

# 기본 수학 1 - Fly me to the Alpha Centauri

# 03/16 화요일

# 백트래킹 - N과 M

# DFS와 BFS - 단지번호붙이기

# 동적계획법 - 가장 긴 증가하는 부분 수열

# 동적계획법 - 가장 긴 바이토닉 부분 수열

# 정수론 및 조합론 - 최대공약수와 최소 공배수

# 정수론 및 조합론 - 최소 공배수

# 정수론 및 조합론 - 이항 계수 1

# 정수론 및 조합론 - 다리 놓기

# 스택 - 스택

# 스택 - 제로

# 스택 - 괄호

# 큐, 덱 - 큐 2

# 브루트포스 - 블랙잭

# 브루트포스 - 분해합

# 그리디알고리즘 - 잃어버린 괄호

# 기본 수학2 - 터렛

# 

